var numRookCaptures = function(board) {
    let count = 0;
    let x , y ;
    
    //记录车的位置
    for(let i=0;i < 8; i++) {
        for(let j = 0;j<8;j++){
            if(board[i][j] === 'R') {
                x = i;
                y = j;               
            }
        }
    }
    //车的行动方向 西->东(x+1,0) 东->西(x-1,0) 南->北(0,y+1) 北->南(0,y-1)
    const rx = [1,0,-1,0];
    const ry = [0,-1,0,1];
    //按4个方向走
    for(let i=0;i<4;i++){
        //死循环，按一个方向走到底
        for(let j=0; ;j++){
            //记录车在x轴的移动后的坐标
            const mx = x + j*rx[i];
            //y轴
            const my = y + j*ry[i];
             
            //限制车移动的范围,在棋盘范围内，且不碰到象
            if(mx < 0 || mx >=8 || my < 0 || my >=8 || board[mx][my] === 'B') {
                break;
            }
            if(board[mx][my] === 'p') {
                count++;
                break;
            }

        }
    }
     return count;
};
console.log(numRookCaptures([[".",".",".",".",".",".",".","."],[".",".",".","p",".",".",".","."],[".",".",".","R",".",".",".","p"],[".",".",".",".",".",".",".","."],[".",".",".",".",".",".",".","."],[".",".",".","p",".",".",".","."],[".",".",".",".",".",".",".","."],[".",".",".",".",".",".",".","."]]));